# STEP 6: Repeat the computation from the facts and dimension table
Note: You will not have to write any code in this notebook. It's purely to illustrate the performance difference between star and 3NF schemas.

Start by running the code in the cell below to connect to the database.

In [6]:
%load_ext sql

DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'postgres'
DB_PASSWORD = 'Met/14/7472'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)
%sql $conn_string

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
postgresql://postgres:Met/14/7472@127.0.0.1:5432/pagila

## 6.1 Facts Table has all the needed dimensions, no need for deep joins

In [7]:
%%time
%%sql
SELECT movie_key, date_key, customer_key, sales_amount
FROM factsales
LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.
CPU times: user 4.01 ms, sys: 11 Âµs, total: 4.02 ms
Wall time: 11.7 ms

[(40, 20200124, 126, 4.99),
 (90, 20200124, 126, 4.99),
 (117, 20200124, 126, 4.99),
 (130, 20200124, 126, 4.99),
 (139, 20200124, 126, 4.99)]

## 6.2 Join fact table with dimensions to replace keys with attributes
As you run each cell, pay attention to the time that is printed. Which schema do you think will run  faster?

Star schema

In [8]:
%%time
%%sql
SELECT dimMovie.title, dimDate.month, dimCustomer.city, sum(sales_amount) as revenue
FROM factSales 
JOIN dimMovie    on (dimMovie.movie_key      = factSales.movie_key)
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimCustomer on (dimCustomer.customer_key = factSales.customer_key)
group by (dimMovie.title, dimDate.month, dimCustomer.city)
order by dimMovie.title, dimDate.month, dimCustomer.city, revenue desc
LIMIT 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.
CPU times: user 7.05 ms, sys: 0 ns, total: 7.05 ms
Wall time: 1.54 s

[('ACADEMY DINOSAUR', 1, 'Almirante Brown', 15.97),
 ('ACADEMY DINOSAUR', 1, 'Celaya', 5.98),
 ('ACADEMY DINOSAUR', 1, 'Charlotte Amalie', 0.99),
 ('ACADEMY DINOSAUR', 1, 'Cianjur', 6.98),
 ('ACADEMY DINOSAUR', 1, 'Goinia', 10.98),
 ('ACADEMY DINOSAUR', 1, 'Hamilton', 6.99),
 ('ACADEMY DINOSAUR', 1, 'Jos Azueta', 9.98),
 ('ACADEMY DINOSAUR', 1, 'Kaliningrad', 11.97),
 ('ACADEMY DINOSAUR', 1, 'Lipetsk', 12.95),
 ('ACADEMY DINOSAUR', 1, 'Livorno', 12.98)]

In [9]:
%%time
%%sql
SELECT f.title, EXTRACT(month FROM p.payment_date) as month, ci.city, sum(p.amount) as revenue
FROM payment p
JOIN rental r    ON ( p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id )
JOIN film f ON ( i.film_id = f.film_id)
JOIN customer c  ON ( p.customer_id = c.customer_id )
JOIN address a ON ( c.address_id = a.address_id )
JOIN city ci ON ( a.city_id = ci.city_id )
group by (f.title, month, ci.city)
order by f.title, month, ci.city, revenue desc LIMIT 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.
CPU times: user 2.92 ms, sys: 3.81 ms, total: 6.74 ms
Wall time: 121 ms

[('ACADEMY DINOSAUR', 1.0, 'Celaya', Decimal('0.99')),
 ('ACADEMY DINOSAUR', 1.0, 'Cianjur', Decimal('1.99')),
 ('ACADEMY DINOSAUR', 2.0, 'San Lorenzo', Decimal('0.99')),
 ('ACADEMY DINOSAUR', 2.0, 'Sullana', Decimal('1.99')),
 ('ACADEMY DINOSAUR', 2.0, 'Udaipur', Decimal('0.99')),
 ('ACADEMY DINOSAUR', 3.0, 'Almirante Brown', Decimal('1.99')),
 ('ACADEMY DINOSAUR', 3.0, 'Goinia', Decimal('0.99')),
 ('ACADEMY DINOSAUR', 3.0, 'Kaliningrad', Decimal('0.99')),
 ('ACADEMY DINOSAUR', 3.0, 'Kurashiki', Decimal('0.99')),
 ('ACADEMY DINOSAUR', 3.0, 'Livorno', Decimal('0.99'))]

# Conclusion

We were able to show that:
* The star schema is easier to understand and write queries against.
* Queries with a star schema are more performant.